SoCXin/ESP32C3/examples/mqtt_tcp/sdkconfig.defaults.esp32s3
# Override some defaults 
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P18=y
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_EFF=14
